interface Calendar {
  month: string;
  dates: string[];
}

interface CalendarData {
  id: string;
  calendar: Calendar[];
}

export const calendars: CalendarData[] = [
  /* id 1 */
  {
    id: "1",
    calendar: [
      { month: "ธ.ค.", dates: ["21 - 31"] },
      { month: "ม.ค.", dates: ["1 - 18"] },
    ],
  },
  /* id 2 */
  {
    id: "2",
    calendar: [{ month: "ต.ค.", dates: ["12 - 27"] }],
  },
  /* id 3 */
  {
    id: "3",
    calendar: [
      { month: "เม.ย.", dates: ["1 - 30"] },
      { month: "พ.ค.", dates: ["1 - 31"] },
    ],
  },
  /* id 4 */
  {
    id: "4",
    calendar: [{ month: "เม.ย.", dates: ["1 - 21"] }],
  },
  /* id 5 */
  {
    id: "5",
    calendar: [{ month: "เม.ย.", dates: ["1 - 30"] }],
  },
  /* id 6 */
  {
    id: "6",
    calendar: [
      { month: "เม.ย.", dates: ["1 - 30"] },
      { month: "พ.ค.", dates: ["1 - 31"] },
    ],
  },
  /* id 7 */
  {
    id: "7",
    calendar: [
      { month: "เม.ย.", dates: ["1 - 30"] },
      { month: "พ.ค.", dates: ["1 - 31"] },
      { month: "มิ.ย.", dates: ["1 - 30"] },
    ],
  },
  /* id 8 */
  {
    id: "8",
    calendar: [
      { month: "มิ.ย.", dates: ["29 - 30"] },
      { month: "ก.ค.", dates: ["1 - 26"] },
    ],
  },
  /* id 9 */
  {
    id: "9",
    calendar: [
      { month: "ธ.ค.", dates: ["21 - 31"] },
      { month: "ม.ค.", dates: ["1 - 18"] },
    ],
  },
  /* id 10 */
  {
    id: "10",
    calendar: [{ month: "เม.ย.", dates: ["1 - 14"] }],
  },
  /* id 11 */
  {
    id: "11",
    calendar: [{ month: "เม.ย.", dates: ["1 - 21"] }],
  },
  /* id 12 */
  {
    id: "12",
    calendar: [{ month: "เม.ย.", dates: ["1 - 30"] }],
  },
  /* id 13 */
  {
    id: "13",
    calendar: [
      { month: "เม.ย.", dates: ["1 - 30"] },
      { month: "พ.ค.", dates: ["1 - 31"] },
    ],
  },
  /* id 14 */
  {
    id: "14",
    calendar: [
      { month: "เม.ย.", dates: ["1 - 30"] },
      { month: "พ.ค.", dates: ["1 - 31"] },
      { month: "มิ.ย.", dates: ["1 - 30"] },
    ],
  },
  /* id 15 */
  {
    id: "15",
    calendar: [{ month: "เม.ย.", dates: ["1 - 30"] }],
  },
  /* id 16 */
  {
    id: "16",
    calendar: [{ month: "เม.ย.", dates: ["1 - 30"] }],
  },
  /* id 17 */
  {
    id: "17",
    calendar: [{ month: "เม.ย.", dates: ["1 - 30"] }],
  },
  /* id 18 */
  {
    id: "18",
    calendar: [{ month: "เม.ย.", dates: ["1 - 30"] }],
  },
  /* id 19 */
  {
    id: "19",
    calendar: [{ month: "เม.ย.", dates: ["1 - 21"] }],
  },
];

export const contents = [
  {
    id: "1",
    content:
      "มหาวิทยาลัย top 10 ของจีน-เรียนจีนได้ทั้ง 4 ทักษะ พูด ฟัง อ่านและเขียน-เที่ยวเมืองหนาวฮาร์บิน-พิพิธภัณฑ์ของมหาลัย(HIT)-พิพิธภัณฑ์เฮยหลงเจีย-ถนนจงหยาง-โบสถ์เซนต์โซเฟีย-ลานน้ำแข็งแม่น้ำซงหัว-เกาะพระอาทิตย์-สวนสนุกโลกน้ำแข็ง-หิมะฮาร์บิน-หมู่บ้านรัสเซีย-เมืองเก่าฮาร์บิน-สวนเสือฮาร์บิน-โรงละครฮาร์บิน",
  },
  {
    id: "2",
    content:
      "มหาวิทยาลัย top 10 ของจีน-เรียนจีนได้ทั้ง 4 ทักษะ พูด ฟัง อ่านและเขียน-แม่น้ำซงฮวาเจียง-นั่งกระเช้าข้ามแม่น้ำซงหัว-อุทยานแห่งชาติเกาะพระอาทิตย์-เมืองเก่าฮาร์บิน-หมู่บ้านรัสเซีย-วัดจี๋เล่อ-โรงละครฮาร์บิน-สวนสัตว์ฮาร์บิน",
  },
  {
    id: "3",
    content:
      "มหาวิทยาลัย top 10 ของจีน-เรียนจีนได้ทั้ง 4 ทักษะ พูด ฟัง อ่านและเขียน-เที่ยวเมืองหนาวฮาร์บิน-พิพิธภัณฑ์ของมหาลัย(HIT)-พิพิธภัณฑ์เฮยหลงเจีย-ถนนจงหยาง-โบสถ์เซนต์โซเฟีย-ลานน้ำแข็งแม่น้ำซงหัว-เกาะพระอาทิตย์-สวนสนุกโลกน้ำแข็ง-หิมะฮาร์บิน-หมู่บ้านรัสเซีย-เมืองเก่าฮาร์บิน-สวนเสือฮาร์บิน-โรงละครฮาร์บิน",
  },
  {
    id: "4",
    content:
      "มหาวิทยาลัย top 10 ของจีน-เรียนจีนได้ทั้ง 4 ทักษะ พูด ฟัง อ่านและเขียน-เที่ยวเมืองหนาวฮาร์บิน-พิพิธภัณฑ์ของมหาลัย(HIT)-พิพิธภัณฑ์เฮยหลงเจีย-ถนนจงหยาง-โบสถ์เซนต์โซเฟีย-ลานน้ำแข็งแม่น้ำซงหัว-เกาะพระอาทิตย์-สวนสนุกโลกน้ำแข็ง-หิมะฮาร์บิน-หมู่บ้านรัสเซีย-เมืองเก่าฮาร์บิน-สวนเสือฮาร์บิน-โรงละครฮาร์บิน",
  },
  {
    id: "5",
    content:
      "มหาวิทยาลัย top 10 ของจีน-เรียนจีนได้ทั้ง 4 ทักษะ พูด ฟัง อ่านและเขียน-เที่ยวเมืองหนาวฮาร์บิน-พิพิธภัณฑ์ของมหาลัย(HIT)-พิพิธภัณฑ์เฮยหลงเจีย-ถนนจงหยาง-โบสถ์เซนต์โซเฟีย-ลานน้ำแข็งแม่น้ำซงหัว-เกาะพระอาทิตย์-สวนสนุกโลกน้ำแข็ง-หิมะฮาร์บิน-หมู่บ้านรัสเซีย-เมืองเก่าฮาร์บิน-สวนเสือฮาร์บิน-โรงละครฮาร์บิน",
  },
  {
    id: "6",
    content:
      "มหาวิทยาลัย top 10 ของจีน-เรียนจีนได้ทั้ง 4 ทักษะ พูด ฟัง อ่านและเขียน-เที่ยวเมืองหนาวฮาร์บิน-พิพิธภัณฑ์ของมหาลัย(HIT)-พิพิธภัณฑ์เฮยหลงเจีย-ถนนจงหยาง-โบสถ์เซนต์โซเฟีย-ลานน้ำแข็งแม่น้ำซงหัว-เกาะพระอาทิตย์-สวนสนุกโลกน้ำแข็ง-หิมะฮาร์บิน-หมู่บ้านรัสเซีย-เมืองเก่าฮาร์บิน-สวนเสือฮาร์บิน-โรงละครฮาร์บิน",
  },
  {
    id: "7",
    content:
      "มหาวิทยาลัย top 10 ของจีน-เรียนจีนได้ทั้ง 4 ทักษะ พูด ฟัง อ่านและเขียน-เที่ยวเมืองหนาวฮาร์บิน-พิพิธภัณฑ์ของมหาลัย(HIT)-พิพิธภัณฑ์เฮยหลงเจีย-ถนนจงหยาง-โบสถ์เซนต์โซเฟีย-ลานน้ำแข็งแม่น้ำซงหัว-เกาะพระอาทิตย์-สวนสนุกโลกน้ำแข็ง-หิมะฮาร์บิน-หมู่บ้านรัสเซีย-เมืองเก่าฮาร์บิน-สวนเสือฮาร์บิน-โรงละครฮาร์บิน",
  },
  {
    id: "8",
    content:
      "มหาวิทยาลัย top 10 ของจีน-เรียนจีนได้ทั้ง 4 ทักษะ พูด ฟัง อ่านและเขียน-ถนนจงหยาง-โบสถ์เซนต์โซเฟีย-อาหารตงเป่ย-พิพิธภัณฑ์ของมหาลัย-นั่งกระเช้าข้ามแม่น้ำซงฮวา-เมืองเก่าฮาร์บิน-เกาะพระอาทิตย์-โรงละครโอเปร่าฮาร์บิน-เทศกาลแกะสลักน้ำแข็ง-พิพิธภัณฑ์วิทยาศาสตร์และเทคโนโลยีเฮย์หลงเจียง",
  },
  {
    id: "9",
    content:
      "มหาวิทยาลัย top 10 ของจีน-เรียนจีนได้ทั้ง 4 ทักษะ พูด ฟัง อ่านและเขียน-พิพิธภัณฑ์ของมหาลัย-ถนนจงหยาง-โบสถ์เซนต์โซเฟีย-ลานน้ำแข็งแม่น้ำซงหัว-นั่งกระเช้าลอยฟ้าชมลานนน้ำแข็ง-เกาะพระอาทิตย์-สวนสนุกโลกน้ำแข็ง-หิมะฮาร์บิน-หมู่บ้านรัสเซีย-เมืองเก่าฮาร์บิน-สวนเสือฮาร์บิน-โรงละครฮาร์บิน-พิพิธภัณฑ์เฮยหลงเจีย",
  },
  {
    id: "10",
    content:
      "มหาวิทยาลัย top 10 ของจีน-เรียนจีนได้ทั้ง 4 ทักษะ พูด ฟัง อ่านและเขียน-เที่ยวเมืองหนาวฮาร์บิน-พิพิธภัณฑ์ของมหาลัย(HIT)-พิพิธภัณฑ์เฮยหลงเจีย-ถนนจงหยาง-โบสถ์เซนต์โซเฟีย-ลานน้ำแข็งแม่น้ำซงหัว-เกาะพระอาทิตย์-สวนสนุกโลกน้ำแข็ง-หิมะฮาร์บิน-หมู่บ้านรัสเซีย-เมืองเก่าฮาร์บิน-สวนเสือฮาร์บิน-โรงละครฮาร์บิน",
  },
  {
    id: "11",
    content:
      "มหาวิทยาลัย top 10 ของจีน-เรียนจีนได้ทั้ง 4 ทักษะ พูด ฟัง อ่านและเขียน-เที่ยวเมืองหนาวฮาร์บิน-พิพิธภัณฑ์ของมหาลัย(HIT)-พิพิธภัณฑ์เฮยหลงเจีย-ถนนจงหยาง-โบสถ์เซนต์โซเฟีย-ลานน้ำแข็งแม่น้ำซงหัว-เกาะพระอาทิตย์-สวนสนุกโลกน้ำแข็ง-หิมะฮาร์บิน-หมู่บ้านรัสเซีย-เมืองเก่าฮาร์บิน-สวนเสือฮาร์บิน-โรงละครฮาร์บิน",
  },
  {
    id: "12",
    content:
      "มหาวิทยาลัย top 10 ของจีน-เรียนจีนได้ทั้ง 4 ทักษะ พูด ฟัง อ่านและเขียน-เที่ยวเมืองหนาวฮาร์บิน-พิพิธภัณฑ์ของมหาลัย(HIT)-พิพิธภัณฑ์เฮยหลงเจีย-ถนนจงหยาง-โบสถ์เซนต์โซเฟีย-ลานน้ำแข็งแม่น้ำซงหัว-เกาะพระอาทิตย์-สวนสนุกโลกน้ำแข็ง-หิมะฮาร์บิน-หมู่บ้านรัสเซีย-เมืองเก่าฮาร์บิน-สวนเสือฮาร์บิน-โรงละครฮาร์บิน",
  },
  {
    id: "13",
    content:
      "มหาวิทยาลัย top 10 ของจีน-เรียนจีนได้ทั้ง 4 ทักษะ พูด ฟัง อ่านและเขียน-เที่ยวเมืองหนาวฮาร์บิน-พิพิธภัณฑ์ของมหาลัย(HIT)-พิพิธภัณฑ์เฮยหลงเจีย-ถนนจงหยาง-โบสถ์เซนต์โซเฟีย-ลานน้ำแข็งแม่น้ำซงหัว-เกาะพระอาทิตย์-สวนสนุกโลกน้ำแข็ง-หิมะฮาร์บิน-หมู่บ้านรัสเซีย-เมืองเก่าฮาร์บิน-สวนเสือฮาร์บิน-โรงละครฮาร์บิน",
  },
  {
    id: "14",
    content:
      "มหาวิทยาลัย top 10 ของจีน-เรียนจีนได้ทั้ง 4 ทักษะ พูด ฟัง อ่านและเขียน-เที่ยวเมืองหนาวฮาร์บิน-พิพิธภัณฑ์ของมหาลัย(HIT)-พิพิธภัณฑ์เฮยหลงเจีย-ถนนจงหยาง-โบสถ์เซนต์โซเฟีย-ลานน้ำแข็งแม่น้ำซงหัว-เกาะพระอาทิตย์-สวนสนุกโลกน้ำแข็ง-หิมะฮาร์บิน-หมู่บ้านรัสเซีย-เมืองเก่าฮาร์บิน-สวนเสือฮาร์บิน-โรงละครฮาร์บิน",
  },
  {
    id: "15",
    content:
      "มหาวิทยาลัย top 10 ของจีน-เรียนจีนได้ทั้ง 4 ทักษะ พูด ฟัง อ่านและเขียน-เที่ยวเมืองหนาวฮาร์บิน-พิพิธภัณฑ์ของมหาลัย(HIT)-พิพิธภัณฑ์เฮยหลงเจีย-ถนนจงหยาง-โบสถ์เซนต์โซเฟีย-ลานน้ำแข็งแม่น้ำซงหัว-เกาะพระอาทิตย์-สวนสนุกโลกน้ำแข็ง-หิมะฮาร์บิน-หมู่บ้านรัสเซีย-เมืองเก่าฮาร์บิน-สวนเสือฮาร์บิน-โรงละครฮาร์บิน",
  },
  {
    id: "16",
    content:
      "มหาวิทยาลัย top 10 ของจีน-เรียนจีนได้ทั้ง 4 ทักษะ พูด ฟัง อ่านและเขียน-เที่ยวเมืองหนาวฮาร์บิน-พิพิธภัณฑ์ของมหาลัย(HIT)-พิพิธภัณฑ์เฮยหลงเจีย-ถนนจงหยาง-โบสถ์เซนต์โซเฟีย-ลานน้ำแข็งแม่น้ำซงหัว-เกาะพระอาทิตย์-สวนสนุกโลกน้ำแข็ง-หิมะฮาร์บิน-หมู่บ้านรัสเซีย-เมืองเก่าฮาร์บิน-สวนเสือฮาร์บิน-โรงละครฮาร์บิน",
  },
  {
    id: "17",
    content:
      "มหาวิทยาลัย top 10 ของจีน-เรียนจีนได้ทั้ง 4 ทักษะ พูด ฟัง อ่านและเขียน-เที่ยวเมืองหนาวฮาร์บิน-พิพิธภัณฑ์ของมหาลัย(HIT)-พิพิธภัณฑ์เฮยหลงเจีย-ถนนจงหยาง-โบสถ์เซนต์โซเฟีย-ลานน้ำแข็งแม่น้ำซงหัว-เกาะพระอาทิตย์-สวนสนุกโลกน้ำแข็ง-หิมะฮาร์บิน-หมู่บ้านรัสเซีย-เมืองเก่าฮาร์บิน-สวนเสือฮาร์บิน-โรงละครฮาร์บิน",
  },
  {
    id: "18",
    content:
      "มหาวิทยาลัย top 10 ของจีน-เรียนจีนได้ทั้ง 4 ทักษะ พูด ฟัง อ่านและเขียน-เที่ยวเมืองหนาวฮาร์บิน-พิพิธภัณฑ์ของมหาลัย(HIT)-พิพิธภัณฑ์เฮยหลงเจีย-ถนนจงหยาง-โบสถ์เซนต์โซเฟีย-ลานน้ำแข็งแม่น้ำซงหัว-เกาะพระอาทิตย์-สวนสนุกโลกน้ำแข็ง-หิมะฮาร์บิน-หมู่บ้านรัสเซีย-เมืองเก่าฮาร์บิน-สวนเสือฮาร์บิน-โรงละครฮาร์บิน",
  },
  {
    id: "19",
    content:
      "มหาวิทยาลัย top 10 ของจีน-เรียนจีนได้ทั้ง 4 ทักษะ พูด ฟัง อ่านและเขียน-วัดจี๋เล่อ-พิพิธภัณฑ์อวกาศมหาลัย HIT-นั่งกระเช้าลอยฟ้าฮาร์บิน-ถนนจงหยาง-แม่น้ำซงฮวาเจียง-เกาะพระอาทิตย์-เมืองเก่าฮาร์บิน-หมู่บ้านรัสเซีย-โรงละครฮาร์บิน",
  },
];
